# Taps
tap "caskroom/cask"
tap "homebrew/core"

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install binaries
brew "exercism"
brew "git"
brew "go"
brew "mas"
brew "wget"

# Applications
cask "adium"
cask "flux"
cask "hazel"
cask "scrivener"
cask "focus"
cask "alfred"
cask "slack"
cask "1password"
cask "fantastical"

# App Store Purchases
mas "Magnet", id: 441258766
