# Taps
tap "caskroom/cask"
tap "homebrew/core"

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install binaries
brew "exercism"
brew "git"
brew "go"
brew "mas"
brew "wget"
brew "newsboat"
brew "shpotify"
brew "go"

# Applications
cask "adium"
cask "spotify"
cask "flux"
cask "hazel"
cask "dropbox"
cask "scrivener"
cask "focus"
cask "alfred"
cask "slack"

# App Store Purchases
mas "1Password", id: 443987910
mas "Magnet", id: 441258766
