# Taps
tap "caskroom/cask"
tap "homebrew/core"

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install binaries
brew "autoconf"
brew "ecm"
brew "exercism"
brew "git"
brew "gnupg"
brew "go"
brew "libxml2"
brew "mas"
brew "md5sha1sum"
brew "mysql"
brew "n"
brew "node"
brew "openssl@1.1"
brew "pkg-config"
brew "rbenv"
brew "wget"
brew "yarn"

# Applications
cask "adium"
cask "insomnia" # HTTP Client
cask "spotify"
cask "flux"
cask "hazel"
cask "dropbox"
cask "dash"
cask "scrivener"
cask "focus"
cask "alfred"
cask "atom"
cask "slack"
cask "google-chrome"

# App Store Purchases
mas "1Password", id: 443987910
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
